import { CommonQuestion,MenuQuestions,MenuTopic } from "@/interfaces/supportPage";

const question1: CommonQuestion = {
    question: 'چرا با اینکه پرداخت انجام داده‌ام خدمتی دریافت نکرده‌ام؟',
    link: '#'
    }
const question2: CommonQuestion = {
    question: 'چگونه به رد شدن آگهی خود اعتراض کنم؟',
    link: '#'
    }
const question3: CommonQuestion = {
    question: 'چگونه آگهی مورد نظر خود را در دیوار پیدا کنم؟',
    link: '#'
    }
const question4: CommonQuestion = {
    question: 'چرا وضعیت اگهی من در انتظار پرداخت است؟',
    link: '#'
    }

export const questionsList: CommonQuestion[] = [
    question1, question2, question3, question4
    ]

export const menuItems: {state: string, title: string}[] = [
    {
        title: 'پرداخت و موارد مالی',
        state: 'payment'
    },
    {
        title: 'ثبت، ویرایش یا ارتقا آگهی',
        state: 'edit'
    },
    {
        title: 'کلاهبرداری، مزاحمت یا تخلف',
        state: 'violation'
    },
    {
        title: 'حساب کاربری، چت و تماس ناشناس',
        state: 'account'
    },
    {
        title: 'نمایش و جستجوی آگهی',
        state: 'search'
    },
    {
        title: 'دیوار برای کسب و کار‌ها',
        state: 'business'
    }
    ]


export const menuQuestions: MenuQuestions = {
    payment: [
        {
            topic: 'پرداخت و مشکلات پراخت',
            questions: [
                'چرا وضعیت آگهی من «در انتظار پرداخت» است؟',
                'چطور در دیوار پرداخت انجام دهم؟',
                'چرا با اینکه پرداخت را انجام داده‌ام، خدمتی دریافت نکرده‌ام؟',
                'چطور از وضعیت پرداخت خود باخبر شوم؟'
            ]
        },
        {
            topic: 'کیف پول بازارپی',
            questions: [
                'کیف پول مشترک پنل فروشگاه',
                'کیف پول مشترک پنل املاک',
                'آموزش تصویری استفاده از کیف پول در پنل املاک',
                'آموزش تصویری استفاده از کیف پول در پنل املاک'
            ]

        },
        {
            topic: 'تعرفه و خدمات',
            questions: [
                'آموزش تصویری استفاده از کیف پول در پنل املاک'
            ]
        },
        {
            topic: 'ارتقا آگهی و افزایش بازدید',
            questions: [
                'خدمات دیوار برای ارتقای آگهی (نردبان، فوری و...) چیست؟'
            ]
        }

        ],
    edit : [
        {
            topic: 'ثبت آگهی',
            questions: [
                'شرایط ثبت آگهی در دیوار',
                'چگونه در دیوار آگهی ثبت کنم؟',
                'دسته‌بندی‌های اصلی دیوار کدامند؟',
                'آیا برای ثبت آگهی باید حساب کاربری بسازم؟',
                'پس از حذف آگهی در چه صورت مجاز به ثبت مجدد همان آگهی هستم؟',
                'لیست کالاها و فعالیت‌های غیر‌مجاز',
                'حد مجاز ارسال آگهی در دیوار چه تعداد است؟',
                'انقضای آگهی در دیوار به چه معناست؟',
                'چطور شمارهٔ ثابت خود را در آگهی ثبت کنم؟'
            ]
        },
        {
            topic: 'رد یا حذف آگهی',
            questions: [
                'چگونه به رد شدن آگهی خود اعتراض کنم؟',
                'چطور از علت حذف یا رد آگهی خود باخبر شوم؟',
                'چرا آگهی من به خاطر دسته‌بندی غیرمرتبط رد شده است؟',
                'چرا آگهی من از روی دیوار حذف شده است؟',
                'پرتکرارترین دلایل رد عکس آگهی کدامند؟',
            ]
        },
        {
            topic: 'انتشار آگهی',
            questions: [
                'چرا آگهی من منتشر نشده است؟',
                'چرا آگهی من بدون عکس منتشر شده‌ است؟',
                'چرا وضعیت آگهی من «در انتظار پرداخت» است؟',
                'چقدر زمان می‌برد تا آگهی من روی دیوار منتشر شود؟'
            ]
        },
        {
            topic: 'مدیریت و ویرایش آگهی',
            questions: [
                'چطور آگهی‌های خود را مدیریت کنم؟'
            ]
        },
        {
            topic: 'ازتقا آگهی و افزایش بازدید',
            questions: [
                'خدمات دیوار برای ارتقای آگهی (نردبان، فوری و...) چیست؟',
                'چطور بازدید آگهی خود را افزایش دهم؟'
            ]
        }
        ],
    violation: [
        {
            topic: 'کلاهبرداری با مزاحمت',
            questions: [
                'فیشینگ (کلاهبرداری آنلاین از طریق درگاه بانکی غیر واقعی) چیست؟',
                'در صورت ایجاد مزاحمت در کانال‌های ارتباطی چه‌کار کنم؟',
                'در صورت دریافت درخواست مشکوک به کلاهبرداری چه کار کنم؟',
                'چگونه امنیت حساب خود را افزایش دهم؟',
                'دیوار از چه سرشماره‌هایی پیامک ارسال می‌کند؟'
            ]
        },
        {
            topic: 'مشکلات آگهی',
            questions: [
                'چگونه مشکل یک آگهی را گزارش کنم؟',
                'لیست کالاها و فعالیت‌های غیر‌مجاز'
            ]
        },
        {
            topic: 'شکایت قضایی و پیگیری',
            questions: [
                'چطور شکایت خود را ثبت کنم؟',
                'اطلاعات یک آگهی حذف شده را جهت شکایت نیاز دارم.'
            ]
        }
        ],
    account: [
        {
            topic: 'حساب کاربری دیوار',
            questions: [
                "چگونه در «دیوار» حساب کاربری بسازم؟",
                'چگونه اپلیکیشن دیوار را دانلود کنم؟',
                'آیا برای ثبت آگهی باید حساب کاربری بسازم؟',
                'چرا حساب کاربری من مسدود شده است؟'
            ]
        },
        {
            topic: 'ورود و خروج از دیوار',
            questions: [
                'چگونه وارد حساب خود شوم؟',
                'چگونه از حساب کاربری خود خارج شوم؟',
                'کد تأیید چیست؟',
                'چرا کد تأیید برای من ارسال نمی‌شود؟'
            ]
        },
        {
            topic: 'دیوار من',
            questions: [
                'صفحهٔ دیوار من چه امکاناتی دارد؟'
            ]
        },
        {
            topic: 'چت دیوار',
            questions: [
                'چت دیوار چیست؟',
                'پستچی دیوار چیست؟',
                'قوانین استفاده از چت دیوار',
                'چرا چت دیوار من مسدود شده است؟',
                'چطور تنظیمات چت و نوتیفیکیشن را تغییر دهم؟',
                'چطور مکالمه‌های خود در چت‌ را مدیریت کنم؟',
                'چطور نام خود را در چت دیوار ویرایش کنم؟',
                'چگونه به یک مکالمه حذف شده در چت دسترسی پیدا کنم؟'
            ]
        },
        {
            topic: 'تماس ناشناس دیوار',
            questions: [
                'تماس ناشناس دیوار چیست؟'
            ]
        },
        {
            topic: 'سیاست‌نامه و دسترسی‌های دیوار',
            questions: [
                'سیاست‌نامه حریم خصوصی',
                'مجوزهای برنامه دیوار برای دسترسی به دستگاه شما'
            ]
        }
        ],
    search: [
        {
            topic: 'جستجوی آگهی',
            questions: [
                'چگونه آگهی مورد نظر خود را در دیوار پیدا کنم؟',
                'آگهی من در چه شهرهایی نمایش داده می‌شود؟',
                'چطور آگهی‌‌های ثبت‌شده در شهر دیگر را پیدا کنم؟'
            ]

        },
        {
            topic: 'مشکلات مربوط به نمایش و صفحه نمایش آگهی',
            questions: [
                'صفحهٔ نمایش آگهی چه امکاناتی دارد؟',
                'چرا اطلاعات تماس برای من نمایش داده نمی‌شود؟',
                'چرا قیمت یک آگهی نمایش داده نمی‌شود؟'
            ]
        },
        {
            topic: 'رد یا حذف آگهی',
            questions: [
                'چرا آگهی من از روی دیوار حذف شده است؟'
            ]
        },
        {
            topic: 'انتشار آگهی',
            questions: [
                'چرا آگهی من بدون عکس منتشر شده‌ است؟'
            ]
        }
        ],
    business: [
        {
            topic: 'آژانس املاک در دیوار',
            questions: [
                'آژانس املاک شما در دیوار'
            ]
        },
        {
            topic: 'فروشگاه در دیوار',
            questions: [
                'فروشگاه شما در دیوار'
            ]
        },
        {
            topic: 'نمایشگاه خودرو در دیوار',
            questions: [
                'نمایشگاه خودرو شما در دیوار'
            ]

        },
        {
            topic: 'سرویس استخدام در دیوار',
            questions: [
                'سرویس استخدام شما در دیوار'
            ]
        },
        {
            topic: 'پروفایل خدمات در دیوار',
            questions: [
                'پروفایل خدمات شما در دیوار'
            ]
        }

    ]


    }
    
